Repository: cloudshadow/mac-monitor
Catalog: Sources/MonitorControl/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# open
source: Open monitor
zh_hans: 打开监测页面
zh_hant: 開啟監測頁面

# setup
source: Create account
zh_hans: 创建账户
zh_hant: 建立帳戶

# refresh
source: Refresh status
zh_hans: 刷新状态
zh_hant: 重新整理狀態

# password
source: New password
zh_hans: 新密码
zh_hant: 新密碼

# reset
source: Reset password
zh_hans: 重置密码
zh_hant: 重設密碼

# pause
source: Pause recording
zh_hans: 暂停记录
zh_hant: 暫停記錄

# resume
source: Resume recording
zh_hans: 恢复记录
zh_hant: 恢復記錄

# clear
source: Clear history
zh_hans: 清空历史
zh_hant: 清除歷史

# start
source: Start service
zh_hans: 启动服务
zh_hant: 啟動服務

# stop
source: Stop service
zh_hans: 停止服务
zh_hant: 停止服務

# enable
source: Enable at boot
zh_hans: 开机启动
zh_hant: 開機啟動

# disable
source: Disable at boot
zh_hans: 关闭开机启动
zh_hant: 關閉開機啟動

source: Uninstall
zh_hans: 卸载
zh_hant: 解除安裝

# status
source: Status: %1$@
zh_hans: 状态：%1$@
zh_hant: 狀態：%1$@

# error
source: Could not complete this action.
zh_hans: 操作未能完成。
zh_hant: 操作未能完成。

source: Language
zh_hans: 语言
zh_hant: 語言

# update
source: Check for updates
zh_hans: 检查更新
zh_hant: 檢查更新

# copyCommand
source: Copy install command
zh_hans: 复制安装命令
zh_hant: 複製安裝指令

# background
source: Closing the window keeps monitoring active. Quit (⌘Q) stops this session. The boot preference and current service are controlled independently.
zh_hans: 关闭窗口会继续监控；退出（⌘Q）会停止本次监控。开机启动和当前服务运行状态独立控制。
zh_hant: 關閉視窗會繼續監控；結束（⌘Q）會停止本次監控。開機啟動和目前服務執行狀態各自控制。

source: Cancel
zh_hans: 取消
zh_hant: 取消

# recover
source: Recover damaged account state (preserves history)
zh_hans: 恢复损坏的账户状态（保留历史）
zh_hant: 復原損壞的帳戶狀態（保留歷史）

# deleteData
source: Delete saved account, history and TLS data when uninstalling
zh_hans: 卸载时删除已保存的账户、历史和 TLS 数据
zh_hant: 解除安裝時刪除已儲存的帳戶、歷史及 TLS 資料

# serviceState
source: Start at boot: %1$@ · Service running: %2$@
zh_hans: 开机启动：%1$@ · 服务运行：%2$@
zh_hant: 開機啟動：%1$@ · 服務執行：%2$@

source: Yes
zh_hans: 是
zh_hant: 是

source: No
zh_hans: 否
zh_hant: 否

# refreshHelp
source: Refresh the monitor address, network interfaces, and recording status. This does not restart the service.
zh_hans: 重新查询监测地址、网络接口和记录状态，不会重启服务。
zh_hant: 重新查詢監測位址、網路介面和記錄狀態，不會重新啟動服務。

# lanHelp
source: LAN access is enabled automatically on en0. Sign in with the same account and password. Other devices must trust this Mac’s local CA certificate for HTTPS.
zh_hans: 局域网默认在 en0 开启，使用相同账号密码登录。其他设备首次使用 HTTPS 时需信任这台 Mac 的本地 CA 证书。
zh_hant: 區域網路預設在 en0 開啟，使用相同帳號密碼登入。其他裝置首次使用 HTTPS 時需信任這台 Mac 的本機 CA 憑證。

# quitFailed
source: The service did not confirm shutdown (%1$@). The control window will close; monitoring may still be running.
zh_hans: 后台服务未确认停止（%1$@）。控制窗口将关闭，监控可能仍在运行。
zh_hant: 背景服務未確認停止（%1$@）。控制視窗將關閉，監控可能仍在執行。

# version
source: Version %2$@ · build %1$@
zh_hans: 版本 %2$@ · 构建 %1$@
zh_hant: 版本 %2$@ · 建置 %1$@

# serviceUnavailable
source: The monitoring service is unavailable (%1$@). Click Start service to resume.
zh_hans: 监控服务暂不可用（%1$@），请点击“启动服务”恢复。
zh_hant: 監控服務暫時無法使用（%1$@），請點選「啟動服務」恢復。

# actionFailed
source: Could not complete this action (%1$@).
zh_hans: 操作未完成（%1$@）。
zh_hant: 操作未完成（%1$@）。

# browserFailed
source: The browser could not be opened. Copy the monitor address into your browser.
zh_hans: 无法打开浏览器，请将监控地址复制到浏览器。
zh_hant: 無法開啟瀏覽器，請將監控地址複製到瀏覽器。

# lanUnavailable
source: LAN on en0 is unavailable (%1$@); local monitoring remains available.
zh_hans: en0 局域网暂不可用（%1$@），本机监控仍可使用。
zh_hant: en0 區域網路暫時無法使用（%1$@），本機監控仍可使用。

# certificate
source: HTTPS CA certificate: %1$@
zh_hans: HTTPS CA 证书：%1$@
zh_hant: HTTPS CA 憑證：%1$@

# checking
source: Checking status…
zh_hans: 正在检查状态…
zh_hant: 正在檢查狀態…

# upToDate
source: You are up to date.
zh_hans: 当前已是最新版本。
zh_hant: 目前已是最新版本。

# updateFailed
source: Could not check for updates: %1$@
zh_hans: 检查更新失败：%1$@
zh_hant: 檢查更新失敗：%1$@

# port
source: Monitor port
zh_hans: 监测端口
zh_hant: 監測連接埠

source: Apply port
zh_hans: 应用端口
zh_hant: 套用連接埠

# portHelp
source: Use one port (1–65535) for local HTTP and LAN HTTPS. Changes take effect immediately and are saved for the next start. Reopen the monitor after changing the port.
zh_hans: 本机 HTTP 与局域网 HTTPS 共用端口（1–65535）。修改后立即生效并保存，下次启动沿用。修改后请重新打开监测页面。
zh_hant: 本機 HTTP 與區域網路 HTTPS 共用連接埠（1–65535）。修改後立即生效並儲存，下次啟動沿用。修改後請重新開啟監測頁面。

# invalidPort
source: Enter a whole port number from 1 to 65535.
zh_hans: 请输入 1 到 65535 之间的整数端口号。
zh_hant: 請輸入 1 到 65535 之間的整數連接埠號碼。

# localPortInUse
source: Local port %1$@ is already in use. Choose another port; the current configuration remains active.
zh_hans: 本机端口 %1$@ 已被占用，请选择其他端口；当前配置保持生效。
zh_hant: 本機連接埠 %1$@ 已被占用，請選擇其他連接埠；目前設定維持生效。

# lanPortInUse
source: LAN port %1$@ is already in use. Choose another port; local monitoring remains available.
zh_hans: 局域网端口 %1$@ 已被占用，请选择其他端口；本机监控仍可使用。
zh_hant: 區域網路連接埠 %1$@ 已被占用，請選擇其他連接埠；本機監控仍可使用。

# portBindFailed
source: Could not listen on port %1$@. Check permissions or choose another port; the current configuration remains active.
zh_hans: 无法监听端口 %1$@，请检查权限或选择其他端口；当前配置保持生效。
zh_hant: 無法監聽連接埠 %1$@，請檢查權限或選擇其他連接埠；目前設定維持生效。

# portFallback
source: Configured local port %2$@ is unavailable. Temporarily using %1$@; choose and apply an available port.
zh_hans: 配置的本机端口 %2$@ 不可用，暂时使用 %1$@；请选择可用端口并应用。
zh_hant: 設定的本機連接埠 %2$@ 無法使用，暫時使用 %1$@；請選擇可用連接埠並套用。
